# # 2. გამრავლებისტაბულაორმაგიfor ციკლის_ისდახმარებითდაბეჭდეგამრავლებისტაბულა1_დანმომხმარებლისმიერშეყვანილიმთელირიცხვისჩათვლით.
#
# m = int(input("Enter an integer to generate its multiplication table: "))
#
# for i in range(1, m+1):
#     for j in range(1, m+1):
#         print(f"{j*i} ", end="")
#     print()
#
#
# # 3. საბანკოანგარიშიშეადგინეპროგრამარომელიცგანასახიერებსსაბანკოანგარიშს. მასზეგანთავსებულიათანხა3000 ლარისოდენობით. პროგრამაგეკითხებაგაწეულხარჯსდააკლებსანგარიშსმანამ, სანამარშეიყვან0_ს. შემდეგგიბეჭდავსანგარიშზედარჩენილთანხასდაწყვეტსფუნქციონირებას. თუანგარიშზეარსებულითანხანაკლებიადანახარჯისთანხაზე, პროგრამამუნდადაბეჭდოს, რომანგარიშზეარარისსაკმარისითანხადაგააგრძელოსფუნქციონირება.
# m = 3000
# k = int(input("გაწეული ხარჯი: "))
#
# while True:
#     if m < k:
#         print("ანგარიშზე არ არის საკმარისი თანხა")
#     if k == 0:
#         break
#     if m <= 0:
#         break
#     m = m - k
#     k = int(input("გაწეული ხარჯი: "))
# print(m)
#
#
# #4. თუთიყუშისპროგრამადაწერეპროგრამა_ თუთიყუში. პროგრამამუნდაგაიმეოროსრასაცეტყვიმანამსანამარშეიყვანსიტყვასquit,თუმცაწინდაურთოსკითხვა„User Said Whaaat!?”თუშევიყვანეთსიტყვაHelloდაიბეჭდება„User Said Whaaat!?”“User Said Hello”
# n = input("User Said Whaaat!? ")
#
# while n != "quit":
#     if n == "hello":
#         print("User Said Hello")
#         break
#     n = input("User Said Whaaat!? ")
#
