# # 1. დაწერე პროგრამა რომელიც გეკითხება ჯერ სახელს, შემდეგ გვარს და ინფორმაციის მიღების შემდეგ ტერმინალშ იბეჭდავსერთმანეთისგვერდით.
#
# m = input("Enter your name")
# k = input("Enter your surname")
#
# print(f"{m} {k}")
#
# # 2. დაწერე პროგრამა რომელიც ითხოვს ორ რიცხვს, პირველი რიცხვი აჰყავს მეორისხარისხშიდაშედეგიიბეჭდებატერმინალში.
#
# num1 = int(input("Enter Number1: "))
# num2 = int(input("Enter Number2: "))
#
# print((num1**num2))
#
# # 3. დაწერეპროგრამარომელიცგეკითხებასახელს, გვარს, ასაკსდაქალაქსდაბეჭდავსინფორმაციასშემდეგისახით:
#
# name = input("Name")
# surname = input("Surname")
# age = input("Age")
# city = input("City")
#
# print(f"""
# Name: {name}
# Surname: {surname}
# Age: {age}
# City: {city}""")
#
# # 4. დაწერეპროგრამა, რომელიცგთხოვსშეიყვანონებისმიერისამისხვადასხვახილისდასახელებაცალცალკე. რეზულტატიკიიბეჭდებაშემდეგისახით:
#
# a = input("Fruit1: ")
# b = input("Fruit2: ")
# c = input("Fruit3: ")
#
# print(f"{a}//{b}%%{c}")
#
# # 5. დაწერეპროგრამა, რომელიცგთხოვსშეიყვანოტექსტი, დათვლისმასშიარსებულისიმბოლოებისრაოდენობასდაგამოიტანსშედეგსშემდეგნაირად:
#
# t = input("Enter text")
# num = len(t)
#
# print(f"Number of symbols: {num}")
#
